

&После("ПередЗаписью")
Процедура пр_ПередЗаписью(Отказ)
	
	Узел = ПланыОбмена.пр_СинхронизацияGitLab.НайтиПоКоду("gitlab");
	СписокУзлов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Узел); 
	
	СтруктураЗадания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "пр_ЗаданиеЗакрыто, пр_ИдентификаторЗадания"); 
	МеткаКолонки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КолонкаКалендаря, "пр_МеткаКолонки"); 
	
	Если (СтруктураЗадания.пр_ИдентификаторЗадания = 0 И МеткаКолонки = "Анализ") Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(СписокУзлов, Источник);
	Иначе
		ПланыОбмена.УдалитьРегистрациюИзменений(СписокУзлов, Источник);
	КонецЕсли;
	
КонецПроцедуры

