
&НаСервере
Процедура СоздатьЗаданияНаСервере()
	
	пр_ИнтеграцияGitLab.СоздатьЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадания(Команда)
	СоздатьЗаданияНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьТокенНаСервере()
	
	пр_ИнтеграцияGitLab.УстановитьТокен(Проект, Токен);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТокен(Команда)
	УстановитьТокенНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоединениеСПроектомНаСервере()
	
	пр_ИнтеграцияGitLab.СоединитьСПроектом(Проект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединениеСПроектом(Команда)
	ПроверитьСоединениеСПроектомНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаданияНаСервере()

	пр_ИнтеграцияGitLab.ПрочитатьЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗадания(Команда)
	ОбновитьЗаданияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаданияКОбновлениюНаСервере()
	пр_ИнтеграцияGitLab.ДобавитьЗаданияКОбновлению();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаданияКОбновлению(Команда)
	ДобавитьЗаданияКОбновлениюНаСервере();
КонецПроцедуры

