
Функция пр_КолонкиКалендаряВладельца(Владелец) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст  = 
	"ВЫБРАТЬ
	|	КолонкиКалендарейСотрудников.Ссылка КАК Ссылка,
	|	КолонкиКалендарейСотрудников.Наименование КАК Наименование,
	|	КолонкиКалендарейСотрудников.Порядок КАК Порядок,
	|	КолонкиКалендарейСотрудников.пр_МеткаКолонки КАК МеткаКолонки
	|ИЗ
	|	Справочник.КолонкиКалендарейСотрудников КАК КолонкиКалендарейСотрудников
	|ГДЕ
	|	КолонкиКалендарейСотрудников.Владелец = &Владелец
	|	И НЕ КолонкиКалендарейСотрудников.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	КолонкиКалендарейСотрудников.Порядок";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
