
&После("ОбработкаПроведения")
Процедура пр_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаРаботу.Ссылка КАК Регистратор,
		|	ЗаданиеНаРаботу.Дата КАК Период,
		|	ЗаданиеНаРаботу.Сотрудник КАК Сотрудник,
		|	ЗаданиеНаРаботу.пр_Проект КАК Проект,
		|	ЗаданиеНаРаботу.пр_Проект.Контрагент КАК Контрагент,
		|	ЗаданиеНаРаботу.пр_ФактGitLab КАК Факт,
		|	ЗаданиеНаРаботу.пр_ПланGitLab КАК Оценка,
		|	ЗаданиеНаРаботу.пр_ПланGitLab - ЗаданиеНаРаботу.пр_ФактGitLab КАК Разница
		|ИЗ
		|	Документ.ЗаданиеНаРаботу КАК ЗаданиеНаРаботу
		|ГДЕ
		|	ЗаданиеНаРаботу.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Движения.пр_ЗаданияНаРаботуПланФакт.Записывать = Истина;
		ЗаписьДвижения = Движения.пр_ЗаданияНаРаботуПланФакт.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьДвижения, ВыборкаДетальныеЗаписи);
	КонецЕсли;	
	
КонецПроцедуры
